backend/performance-tests/resultado-real-api-test.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: real-api-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 2 max VUs, 10m30s max duration (incl. graceful stop):
              * default: 4 iterations shared among 2 VUs (maxDuration: 10m0s, gracefulStop: 30s)



  █ TOTAL RESULTS 

    checks_total.......: 12     20.802087/s
    checks_succeeded...: 75.00% 9 out of 12
    checks_failed......: 25.00% 3 out of 12

    ✗ status 200
      ↳  75% — ✓ 3 / ✗ 1
    ✗ tem score
      ↳  75% — ✓ 3 / ✗ 1
    ✗ tem credibilidade
      ↳  75% — ✓ 3 / ✗ 1

    HTTP
    http_req_duration..............: avg=250.78ms min=105.67ms med=240.88ms max=415.69ms p(90)=370.83ms p(95)=393.26ms
      { expected_response:true }...: avg=195.81ms min=105.67ms med=215.6ms  max=266.16ms p(90)=256.04ms p(95)=261.1ms 
    http_req_failed................: 25.00% 1 out of 4
    http_reqs......................: 4      6.934029/s

    EXECUTION
    iteration_duration.............: avg=286.5ms  min=106.6ms  med=284.82ms max=469.75ms p(90)=434.86ms p(95)=452.3ms 
    iterations.....................: 4      6.934029/s

    NETWORK
    data_received..................: 1.9 kB 3.3 kB/s
    data_sent......................: 1.0 kB 1.8 kB/s



running (00m00.6s), 0/2 VUs, 4 complete and 0 interrupted iterations
default ✓ [ 100% ] 2 VUs  00m00.6s/10m0s  4/4 shared iters